app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @books = Book.all

INSERT INTO "books" ("title", "author", "isbn", "status", "created_at", "updated_at") VALUES ('atomic habbits', 'james clear', 'jrui89', NULL, '2025-02-17 22:17:41.292560', '2025-02-17 22:17:41.292560') RETURNING "id"
---
  def create
    @book = Book.new(book_params)

    if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1
---
  def set_book
    @book = Book.find(params[:id])